Store/src/Documents/ПоступлениеТоваров/ПоступлениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваров</name>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Store/src/Documents/ПоступлениеТоваров/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Привет мир";
	Сообщение.Сообщить();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Сообщить("Привет, пользователь");
	ОписаниеЧеловека = ОписаниеЧеловека();
	ОписаниеЧеловека.Имя = "Иван";
	ОписаниеЧеловека.Фамилия = "Петров";
	ОписаниеЧеловека.Пол = "Мужской";
	ОписаниеЧеловека.ДатаРождения = '19901101';

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	

	Текст = "Изменилась Цена";
	ПересчитатьСумму(ТекущиеДанные, Текст);

КонецПроцедуры


&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Текст = "Изменилось количество";
	ПересчитатьСумму(ТекущиеДанные, Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Пересчитывает сумму в строке на основе количества и цены, выводит сообщения пользователю.
//
// Параметры:
//   Строка - <Тип> - строка с данными для пересчета суммы
//   ТекстСообщения - Строка - текст сообщения для пользователя
&НаКлиенте
Процедура ПересчитатьСумму(Строка, Знач ТекстСообщения)

	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();
	
	Строка.Сумма = Строка.Количество * Строка.Цена * Объект.Скидка / 100;
	
	Человек = ОписаниеЧеловека();
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = Человек.Имя;
	Сообщение.Сообщить();

КонецПроцедуры

// Описание пользователя.
// 
// Возвращаемое значение:
//  Структура - Описание пользователя:
// * Имя - Строка - Имя пользователя, как оно задано в справочнике
// * ДатаРождения - Дата - Дата рождения пользователя
// * Стаж - Число - Число лет, прошедших с момента приема на работу
// * ВШтате - Булево - Признак того, что пользователь работает в штате
// * Подразделение - Строка - Подразделение, в котором работает пользователь
// * Должность - Строка - Должность, занимаемая пользователем
&НаКлиенте
Функция ОписаниеЧеловека()
	
	Человек = Новый Структура;
	Человек.Вставить("Имя", "Антон");
	Человек.Вставить("ДатаРождения", ТекущаяДата());
	Человек.Вставить("Стаж", 14);
	Человек.Вставить("ВШтате", Истина);
	Человек.Вставить("Подразделение", "Отдел 2");
	Человек.Вставить("Должность", "Руководитель");
	
	Возврат Человек;
	
КонецФункции

#КонецОбласти
